In [1]:
import pandas as pd

Using dictionries:

In [3]:
data = {
    'Name': ['Tamanna', 'Faysal', 'Tarek', 'Raisa', 'Imtiaz', 'Farah'],
    'Age': [24, 27, 22, 32, 24, 22],
    'City': ['Dhaka', 'Sylthet', 'Dhaka', 'Khulna', 'Rajshahi', 'Sylhet'],
    'Score': [85, 95, 78, 90, 88, 84]
}
df = pd.DataFrame(data)
df.head()

      Name  Age      City  Score
0  Tamanna   24     Dhaka     85
1   Faysal   27   Sylthet     95
2    Tarek   22     Dhaka     78
3    Raisa   32    Khulna     90
4   Imtiaz   24  Rajshahi     88

Using Tuples/Lists:

In [ ]:
data =